# Part 2

In [4]:
import pandas as pd

data = {
    "Name": ["John", "Sara", "Ali", "Maya"],
    "Age": [16, 17, 15, 16],
    "Marks": [45, 67, 89, 72]
}
df = pd.DataFrame(data)
#selecting single col
print(df["Name"])

0    John
1    Sara
2     Ali
3    Maya
Name: Name, dtype: object

In [2]:
#selecting multi col
print(df[["Name","Marks"]])

   Name  Marks
0  John     45
1  Sara     67
2   Ali     89
3  Maya     72

In [3]:
# first row
print(df.iloc[0])

Name     John
Age        16
Marks      45
Name: 0, dtype: object

In [7]:
# rows where Age > 16
print(df[df["Age"] > 15])

   Name  Age  Marks
0  John   16     45
1  Sara   17     67
3  Maya   16     72

In [8]:
print(df.loc[1, "Name"])

Sara

In [9]:
df["Pass"] = df["Marks"] >= 50
print(df)

   Name  Age  Marks   Pass
0  John   16     45  False
1  Sara   17     67   True
2   Ali   15     89   True
3  Maya   16     72   True

In [10]:
df = df.drop("Pass", axis=1)
print(df)

   Name  Age  Marks
0  John   16     45
1  Sara   17     67
2   Ali   15     89
3  Maya   16     72

In [13]:
print(df.sort_values("Marks", ascending=False))

   Name  Age  Marks
2   Ali   15     89
3  Maya   16     72
1  Sara   17     67
0  John   16     45

In [15]:
print(df[["Name","Age"]])

   Name  Age
0  John   16
1  Sara   17
2   Ali   15
3  Maya   16

In [16]:
print(df[df["Marks"]>60])

   Name  Age  Marks
1  Sara   17     67
2   Ali   15     89
3  Maya   16     72

In [4]:
print(df.columns)

Index(['Name', 'Age', 'Marks'], dtype='object')

In [6]:
def grades(marks):
    if marks >= 80:
        return "A"
    elif marks >= 60:
        return "B"
    else:
        return "C"

df["Grade"] = df["Marks"].apply(grades)
print(df)

   Name  Age  Marks Grade
0  John   16     45     C
1  Sara   17     67     B
2   Ali   15     89     A
3  Maya   16     72     B

In [58]:
import pandas as pd
import numpy as np

data = {
    "Name": ["John", "Sara", "Ali", "Maya"],
    "Age": [16, np.nan, 15, 16],
    "Marks": [45, 67, None, 72]
}
df = pd.DataFrame(data)

print(df)
print(df.isna())
print(df.isna().sum())

   Name   Age  Marks
0  John  16.0   45.0
1  Sara   NaN   67.0
2   Ali  15.0    NaN
3  Maya  16.0   72.0
    Name    Age  Marks
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False
Name     0
Age      1
Marks    1
dtype: int64

In [60]:
df["Age"].fillna(df["Age"].mean())
df["Marks"].fillna(0,inplace=True)
print(df)

   Name        Age  Marks
0  John  16.000000   45.0
1  Sara  15.666667   67.0
2   Ali  15.000000    0.0
3  Maya  16.000000   72.0

C:\Users\MAQBOOL RAASI\AppData\Local\Temp\ipykernel_1488\3811707331.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Marks"].fillna(0,inplace=True)

In [15]:
arr=np.arange(1,10)
b=pd.DataFrame(arr)
print(b)

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9

In [19]:
df=df.rename(columns={"Age":"students_age"})

In [25]:
df["Square"]=df["students_age"]**2
df["students_age"]=np.floor(df["students_age"])
print(df)

   Name  students_age  Marks  Square
0  John          16.0   45.0     256
1  Sara          15.0   67.0     225
2   Ali          15.0    0.0     225
3  Maya          16.0   72.0     256

In [39]:
print(df["students_age"])
print(df.iloc[0])
print(df[df["Marks"]>50])
print(df.iloc[0:3])
print(df["Name"])
print(df[df["students_age"]>15])
print(df.iloc[1:4,0:3:2])

0    16.0
1    15.0
2    15.0
3    16.0
Name: students_age, dtype: float64
Name            John
students_age    16.0
Marks           45.0
Square           256
Name: 0, dtype: object
   Name  students_age  Marks  Square
1  Sara          15.0   67.0     225
3  Maya          16.0   72.0     256
   Name  students_age  Marks  Square
0  John          16.0   45.0     256
1  Sara          15.0   67.0     225
2   Ali          15.0    0.0     225
0    John
1    Sara
2     Ali
3    Maya
Name: Name, dtype: object
   Name  students_age  Marks  Square
0  John          16.0   45.0     256
3  Maya          16.0   72.0     256
   Name  Marks
1  Sara   67.0
2   Ali    0.0
3  Maya   72.0

In [64]:
import pandas as pd
import numpy as np

data = {
    "Name": ["John", "Sara", "Ali", "Maya"],
    "Age": [16, np.nan, 15, 16],
    "Marks": [45, 67, None, 72]
}
df = pd.DataFrame(data)

In [62]:
print(df.isnull().sum())

Name     0
Age      1
Marks    1
dtype: int64

In [47]:
print(df.dropna())

   Name   Age  Marks
0  John  16.0   45.0
3  Maya  16.0   72.0

In [70]:
df["Age"]=df["Age"].fillna(df["Age"].mean())
df["Marks"]=df["Marks"].fillna(0)
print(df)

   Name        Age  Marks
0  John  16.000000   45.0
1  Sara  15.666667   67.0
2   Ali  15.000000    0.0
3  Maya  16.000000   72.0

In [2]:
datass={
    "Name":["Maqbool","Akash","Naseef","Swalih","Husna","Sahal","Safvan",]
}

In [40]:
df=pd.read_csv("clv_data.csv")
df

,Unnamed: 0,id,age,gender,income,days_on_platform,city,purchases
0,0,0,NaN,Male,126895,14.0,San Francisco,0
1,1,1,NaN,Male,161474,14.0,Tokyo,0
2,2,2,24.0,Male,104723,34.0,London,1
3,3,3,29.0,Male,43791,28.0,London,2
4,4,4,18.0,Female,132181,26.0,London,2
...,...,...,...,...,...,...,...,...
4995,4995,4995,NaN,Female,212261,28.0,San Francisco,1
4996,4996,4996,NaN,Male,70228,12.0,San Francisco,0
4997,4997,4997,NaN,Male,64995,14.0,New York City,0
4998,4998,4998,NaN,Male,56144,4.0,New York City,2
4999,4999,4999,NaN,Female,110977,29.0,London,0

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Unnamed: 0        5000 non-null   int64
 1   id                5000 non-null   int64
 2   age               2554 non-null   float64
 3   gender            5000 non-null   object
 4   income            5000 non-null   int64
 5   days_on_platform  4859 non-null   float64
 6   city              5000 non-null   object
 7   purchases         5000 non-null   int64
dtypes: float64(2), int64(4), object(2)
memory usage: 312.6+ KB

In [42]:
df.isnull().sum()

Unnamed: 0             0
id                     0
age                 2446
gender                 0
income                 0
days_on_platform     141
city                   0
purchases              0
dtype: int64

In [55]:
df[df.isnull().any(axis=1)]

Empty DataFrame
Columns: [Unnamed: 0, id, age, gender, income, days_on_platform, city, purchases]
Index: []

In [53]:

df

,Unnamed: 0,id,age,gender,income,days_on_platform,city,purchases
2,2,2,24.0,Male,104723,34.0,London,1
3,3,3,29.0,Male,43791,28.0,London,2
4,4,4,18.0,Female,132181,26.0,London,2
5,5,5,23.0,Male,12315,14.0,New York City,0
8,8,8,46.0,Male,129157,23.0,New York City,0
...,...,...,...,...,...,...,...,...
4986,4986,4986,23.0,Male,75425,6.0,London,1
4989,4989,4989,47.0,Female,84987,30.0,Tokyo,0
4990,4990,4990,33.0,Male,3020,89.0,New York City,0
4991,4991,4991,36.0,Female,26173,34.0,Tokyo,0
4992,4992,4992,26.0,Male,88858,14.0,Miami,3

In [52]:
# df["age"]=df["age"].fillna(df["age"].mean())
# df["days_on_platform"]=df["days_on_platform"].fillna(df["days_on_platform"].mean())
# df

In [44]:
df.isnull().sum()

Unnamed: 0             0
id                     0
age                 2446
gender                 0
income                 0
days_on_platform     141
city                   0
purchases              0
dtype: int64